#
# Основная программа использует макро библиотеку с семинара и дописанные студентом макросы
#
.include "macrolib.s"

.eqv	 MAX_SIZE 102 # Размер буффера. Это 100 символов + '\n\0'

.data
str_a:	.space	MAX_SIZE	# Тут будет храниться оригинальная строка
str_b:	.space	MAX_SIZE	# Тут будет храниться скопированная с помощью подпрограммы строка
str_c:	.space	MAX_SIZE	# Тут будет храниться скопированная с помощью макроса строка

.globl main
.text
main:
    li	a1 MAX_SIZE	# загружаю максимальный размер строки. 
    # Де факто строка может быть 101 символ без перевода строки, если пользователь не переведет строку
    la	a0 str_a	# Загружаю адрес в а0 и читаю в нее строку
    read_str	# Чтение строки, меняется только a0
    la	a2 str_a	# Копирую адреса строк в регистры a
    la	a3 str_b
    la	a4 str_c
    jal strcpy	# Перехожу к подпрограмме для копирования
    la a2 str_a	# Загружаю адрес в а2
    strcpy (a2, a4)	# Копирую строку с помощью макроса
    print_str("\nThis is original string:\n")	# Ипользую макросы для вывода строк.
    # Функционал макросов хорошо описан в их названии.
    print_str_a0
    print_str("\nThis is copied string using other program:\n")
    la	a0 str_b	# Вывожу результат работы подпрограммы
    print_str_a0 
    print_str("\nThis is copied string using macro:\n")
    la	a0 str_c	# Вывожу результат работы макроса
    print_str_a0 
    exit
