.include "macrolib.s"

.data
	# Массивы А и B
	.align 2 
	A: .space 400
	.align 2
	B: .space 400

.text
main:
	# Передаю на вход строку, возвращаемого значения нет, только передача строки
	print_str ("Hello. It's 28 variant of homework 1. The author is Karapetian Artem.\n")
	
	# Макрос, без входных-выходных данных, печатающий новую линию
	newline
	# Передаю на вход строку, возвращаемого значения нет, только передача строки
	print_str ("This program takes array A and turns it into array B which is non-decreasing sorted version of A")
	newline
	# Передаю на вход регистр (а1), в котором буду хранить размер массива. Возвращается упомянутый регистр со значением
	read_size (a1)	# Чтение размера массива
	# Передаю на вход строку, возвращаемого значения нет, только передача строки
	print_str ("The input size is ")  # Вывод размера массива
	# Передаю на вход регистр, возвращаемого значения нет и ничего не меняется, только вывод значения в регистре на экран
	print_int (a1)
    	newline
    	
    	# Передаю на вход массив и регистр со значением размера массива. 
    	# Адреса массива заполняются данными, регистр размера не меняется
    	read_array (A, a1) # Ввод всех элементов массива
    	# Передаю на вход строку, возвращаемого значения нет, только передача строки
    	print_str ("You wrote this array:\n") # Вывод всех элементов массива
    	
    	# Передаю на вход массив и регистр с размером массива.
    	# Возвращаемого значения нет, выводятся данные массива размера данного в регистре.
    	print_array (A, a1)
    	
    	# Передаю на вход массивы А и B, а также размер массива в регистре. 
    	# Массив А не меняется, массив B становится идентичным A
	copy_array (A, B, a1) # Копирование массива А в массив B
	
	# Передаю на вход массив B, а также размер массива в регистре. 
    	# Массив B меняется, регистр не изменяется. Массив B отсортирован
	sort (B, a1) # Сортируем в неубывающем порядке
	newline
	# Передаю на вход строку, возвращаемого значения нет, только передача строки
	print_str  ("Array in non decreasing order:\n") # Вывод отсортированного массива
	
	# Передаю на вход массив и регистр с размером массива.
    	# Возвращаемого значения нет, выводятся данные массива размера данного в регистре.
	print_array (B, a1)
	newline
	exit
